# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.blob_storage: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_private_endpoint.service_bus_private_endpoint[0] must be replaced
-/+ resource "azurerm_private_endpoint" "service_bus_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ custom_network_interface_name = "nicsbsbaltinnaltinnauth001yt01" -> "nicsbsbaltinnauth001yt01" # forces replacement
      ~ id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/privateEndpoints/pesbaltinnaltinnauth001yt01" -> (known after apply)
      ~ name                          = "pesbaltinnaltinnauth001yt01" -> "pesbaltinnauth001yt01" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/networkInterfaces/nicsbsbaltinnaltinnauth001yt01"
              - name = "nicsbsbaltinnaltinnauth001yt01"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/privateEndpoints/pesbaltinnaltinnauth001yt01/privateDnsZoneGroups/sbaltinnaltinnauth001yt01/privateDnsZoneConfigs/privatelink.servicebus.windows.net"
              - name                = "privatelink.servicebus.windows.net"
              - private_dns_zone_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "sbaltinnaltinnauth001yt01.privatelink.servicebus.windows.net"
                      - ip_addresses = [
                          - "10.202.180.4",
                        ]
                      - name         = "sbaltinnaltinnauth001yt01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/privateEndpoints/pesbaltinnaltinnauth001yt01/privateDnsZoneGroups/sbaltinnaltinnauth001yt01" -> (known after apply)
          ~ name                 = "sbaltinnaltinnauth001yt01" -> "sbaltinnauth001yt01"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "sbaltinnaltinnauth001yt01" -> "sbaltinnauth001yt01" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnaltinnauth001yt01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.202.180.4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_servicebus_namespace.service_bus must be replaced
-/+ resource "azurerm_servicebus_namespace" "service_bus" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://sbaltinnaltinnauth001yt01.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnaltinnauth001yt01" -> (known after apply)
      ~ name                                = "sbaltinnaltinnauth001yt01" -> "sbaltinnauth001yt01" # forces replacement
      ~ public_network_access_enabled       = false -> true
        tags                                = {
            "CreatedAt"   = "2025-01-16T09:21:42Z"
            "Environment" = "yt01"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (7 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "fd03c5a2-0e55-4cfc-9d0f-2aff4901be8f" -> (known after apply)
          ~ tenant_id    = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_spokes.tfstate.tfplan`